Tekla Open API Reference for Tekla Structures 2025
CircleRebarGroup.CircleRebarGroupStirrupTypeEnum Enumeration
 The different stirrup types.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum CircleRebarGroupStirrupTypeEnum
Public Enumeration CircleRebarGroupStirrupTypeEnum
Members
Member name | Value | Description
STIRRUP_TYPE_CIRCLE | 0 |  The circle type of stirrup.
STIRRUP_TYPE_SPIRAL | 1 |  The spiral type of stirrup.
See Also
Reference
Tekla.Structures.Model Namespace